import cv2
import numpy as np

src = np.zeros((300,300, 3), dtype=np.uint8)

#
src[0:100, 0:100, 0] = 255 #B 1번칸 파란색
src[0:100, 100:200, 1] = 255 #G 2번칸 초록색
src[0:100, 200:300, 2] = 255 #R 3번칸 빨간색

src[100:200, 0:100, 0] = 255 #B 4번칸 파란색
src[100:200, 0:100, 2] = 255 #R 4번칸 파란색 + 빨간색 = 핑크색

src[100:200, 100:200, 0] = 255 #5번칸 파란색
src[100:200, 100:200, 1] = 255 #5번칸 파란색 + 초록색 = 하늘색

src[100:200, 200:300, 1] = 255 #6번칸 초록색
src[100:200, 200:300, 2] = 255 #6번칸 초록색 + 빨간색 = 노란색

src[200:, :100, 0] = 255 #7번칸 파란색
src[200:, :100, 1] = 255 #7번칸 파란색 + 초록색
src[200:300, 0:100, 2] = 255 #7번칸 파란색 + 초록색 + 빨간색 = 흰색

#8번칸 회색
src[200:, 100:200, 0] = 128
src[200:, 100:200, 1] = 128
src[200:300, 100:200, 2] = 128

#9번칸 default = 검은색

cv2.imshow('src', src)
cv2.waitKey()
cv2.destroyAllWindows()